<template>
  <!--begin::kt_anik_or_appeal_offcier_activity drawer-->
  <div
    id="kt_anik_or_appeal_offcier_activity"
    class="bg-body"
    data-kt-drawer="true"
    data-kt-drawer-name="process-map"
    data-kt-drawer-activate="true"
    data-kt-drawer-overlay="true"
    data-kt-drawer-width="{default:'300px', 'lg': '900px'}"
    data-kt-drawer-direction="end"
    data-kt-drawer-toggle="#kt_anik_or_appeal_offcier_activity_toggle"
    data-kt-drawer-close="#kt_anik_or_appeal_offcier_activity_close"
  >
    <div class="card shadow-none" style="width: 100%">
      <!--begin::Header-->
      <div class="card-header" id="kt_anik_or_appeal_offcier_activity_header">
        <h2 class="card-title fw-bold text-dark"></h2>
        <div class="card-toolbar">
          <button
            type="button"
            class="btn btn-sm btn-icon btn-active-light-primary me-n5"
            id="kt_anik_or_appeal_offcier_activity_close"
          >
            <KTIcon icon-name="cross" icon-class="fs-1" />
          </button>
        </div>
      </div>
      <!--end::Header-->

      <!--begin::Body-->
      <div
        class="card-body position-relative"
        id="kt_anik_or_appeal_offcier_activity_body"
      >
        <!--begin::Content-->
        <div
          id="kt_anik_or_appeal_offcier_activity_scroll"
          class="position-relative scroll-y me-n5 pe-5"
          data-kt-scroll="true"
          data-kt-scroll-height="auto"
          data-kt-scroll-wrappers="#kt_anik_or_appeal_offcier_activity_body"
          data-kt-scroll-dependencies="#kt_anik_or_appeal_offcier_activity_header, #kt_anik_or_appeal_offcier_activity_footer"
          data-kt-scroll-offset="5px"
        >
          <!--begin::Timeline items-->
          <div class="modal-body">
            <h7 class="mt-1"
              >{{ translate("rievanceRedressalManagement") }}:</h7
            >

            <div class="panel panel-default mt-5">
              <div
                class="panel-heading"
                role="button"
                data-bs-toggle="collapse"
                data-bs-target="#kt_kt_grs_guideline1"
                aria-expanded="true"
                aria-controls="kt_kt_grs_guideline1"
              >
                <h4 class="panel-title">
                  <a
                    class="accordion-toggle accordion-toggle-styled"
                    data-parent="#accordion3"
                    data-toggle="collapse"
                  >
                    <span class="processmap-span"
                      >৭.১. অভিযোগ দাখিল পদ্ধতি:</span
                    >
                  </a>
                </h4>
              </div>
            </div>
            <div
              class="panel-body collapse show mt-5"
              id="kt_kt_grs_guideline1"
            >
              <p>
                (ক) অনিক অনুচ্ছেদ ৭.১.১. অনুসরণ করে প্রাপ্ত অভিযোগ প্রাথমিক
                যাচাই-বাছাইয়ের পর দপ্তর প্রধানকে অবহিত রেখে নিম্নরূপ পদক্ষেপ
                গ্রহণ করবেন:
              </p>
              <ol>
                <li>
                  i) অভিযোগ অন্য কোনো দপ্তরের সঙ্গে সংশ্লিষ্ট হলে উক্ত দপ্তরের
                  অনিকের নিকট প্রেরণ এবং আওতাধীন দপ্তরের সেবা-সংক্রান্ত হলে
                  সংশ্লিষ্ট অনিকের নিকট প্রেরণ;
                </li>
                <li>
                  ii) অভিযোগটি অভিযোগ নিষ্পত্তি কর্মকর্তা (অনিক) সম্পর্কিত হলে
                  কার্যক্রম গ্রহণের জন্য সংশ্লিষ্ট আপিল কর্মকর্তার নিকট প্রেরণ;
                </li>
              </ol>
              <ul>
                <li>
                  iii) মন্ত্রণালয়/বিভাগের আপিল কর্মকর্তা সংশ্লিষ্ট হলে দপ্তর
                  প্রধানের অনুমতি সাপেক্ষে তা অভিযোগ ব্যবস্থাপনা সেলে প্রেরণ
                  করতে হবে
                </li>
              </ul>
              <ol>
                <li>
                  iv) মন্ত্রণালয়/বিভাগ ব্যতীত অন্যান্য আপিল কর্মকর্তা সংশ্লিষ্ট
                  হলেও তা অভিযোগ ব্যবস্থাপনা সেলে প্রেরণ করতে হবে;
                </li>
                <li>
                  v) অভিযোগ এই নির্দেশিকার আওতায় গ্রহণযোগ্য না হলে উপযুক্ত কারণ
                  লিপিবদ্ধ করে নথিজাতকরণ;
                </li>
                <li>
                  vi) অভিযোগটি এই নির্দেশিকার আওতায় গ্রহণযোগ্য বিবেচিত হলে
                  সংশ্লিষ্ট সেবার দায়িত্বপ্রাপ্ত কর্মকর্তা/কর্মচারীর মতামতের
                  জন্য প্রেরণ।
                </li>
              </ol>
              <p>
                (খ)&nbsp; সেবা-সংশ্লিষ্ট দায়িত্বপ্রাপ্ত কর্মকর্তার মতামতের জন্য
                অনিক যুক্তিসংগত সময় নির্ধারণ করে দেবেন এবং প্রেরিত অভিযোগের
                সঙ্গে নিম্নোক্ত নির্দেশনা প্রদান করবেন—
              </p>
              <ol>
                <li>
                  i) অভিযোগে উল্লিখিত সেবাটি ইতোমধ্যে প্রদান করা হয়ে থাকলে
                  বিস্তারিত তথ্য প্রদান করতে হবে;
                </li>
                <li>
                  ii) সেবা প্রদান না করা হয়ে থাকলে তা প্রদান করে বিস্তারিত
                  তথ্যসহ অবহিত করতে হবে;
                </li>
              </ol>
              <ul>
                <li>
                  iii) সেবা প্রদানের জন্য অধিকতর সময় প্রয়োজন হলে যথোপযুক্ত কারণ
                  (explanation) জানাতে হবে;
                </li>
              </ul>
              <ol>
                <li>
                  iv) অধীনস্ত কোনো কর্মকর্তা/কর্মচারীর দায়িত্বে অবহেলার কারণে
                  নির্ধারিত সময়ে বা পদ্ধতিতে সেবা প্রদান করা সম্ভব না হয়ে থাকলে
                  বিস্তারিত উল্লেখ করতে হবে;
                </li>
                <li>
                  v) আবেদনের অসম্পূর্ণতা অথবা অন্য কোনো কারণে সেবা প্রদান করা
                  সম্ভব না হলে যথোপযুক্ত কারণ উল্লেখ করতে হবে।
                </li>
              </ol>
              <p>
                (গ)&nbsp; অনিক প্রয়োজনে অভিযোগ-সম্পর্কিত নথি, প্রতিবেদন,
                সংশ্লিষ্ট কাগজপত্রাদি, লিখিত/মৌখিক বক্তব্য ইত্যাদি সংগ্রহ করতে
                পারবেন।
              </p>
              <p>
                (ঘ)&nbsp; মতামত প্রাপ্তির পর অথবা নির্ধারিত সময়ে মতামত পাওয়া না
                গেলে অনুচ্ছেদ ৭.১(ঙ) অনুসারে অনিক পরবর্তী কার্যক্রম গ্রহণ করবেন।
                দায়িত্বপ্রাপ্ত কর্মকর্তা অথবা অধীনস্থ কর্মকর্তা/কর্মচারী কর্তৃক
                সেবা প্রদানের ক্ষেত্রে অসদাচরণ, বিধি-বহির্ভূত কাজ কিংবা অনিয়ম
                সাধিত হয়েছে মর্মে অনিকের নিকট প্রতীয়মান হলে ৭.১.২ অনুচ্ছেদ
                অনুসরণে দপ্তর প্রধানের অনুমতি গ্রহণপূর্বক তিনি তদন্তের উদ্যোগ
                গ্রহণ করতে পারবেন।
              </p>
              <p>
                (ঙ) অনিক দাখিলকৃত অভিযোগ, সংশ্লিষ্ট কাগজপত্রাদি, সেবা
                প্রদানকারীর মতামত, প্রযোজ্য ক্ষেত্রে তদন্ত প্রতিবেদন এবং
                প্রাসঙ্গিক তথ্য পর্যালোচনা করে নিম্নরূপ সিদ্ধান্ত গ্রহণ করবেন—
              </p>
              <ol>
                <li>
                  i) অভিযোগ দাখিলের পর সংশ্লিষ্ট কর্মকর্তা/কর্মচারী কর্তৃক
                  ইতোমধ্যে সেবা প্রদান করা হয়ে থাকলে বিষয়টির নিষ্পত্তি করা হয়েছে
                  বলে গণ্য করবেন। তবে অসদাচরণ, বিধি-বহির্ভূত কাজ কিংবা অনিয়মের
                  ক্ষেত্রে যথোপযুক্ত ব্যবস্থা গ্রহণ করবেন;
                </li>
                <li>
                  ii) দায়িত্বপ্রাপ্ত কর্মকর্তা কর্তৃক সেবা প্রদানের জন্য অধিক
                  সময় প্রয়োজন মর্মে মতামত প্রদান করা হলে অনিক যুক্তিসঙ্গত সময়
                  নির্ধারণ করে উক্ত সেবা প্রদানের নির্দেশনা প্রদান করবেন;
                </li>
              </ol>
              <ul>
                <li>
                  iii) দায়িত্বপ্রাপ্ত কর্মকর্তা কর্তৃক সেবা প্রদান করা সম্ভব নয়
                  মর্মে প্রদত্ত মতামত সন্তোষজনক বিবেচিত হলে অনিক অভিযোগটি
                  নিষ্পন্ন করবেন;
                </li>
              </ul>
              <ol>
                <li>
                  iv) যদি প্রতীয়মান হয় যে, অভিযোগকারীকে প্রত্যাশিত সেবা বা পণ্য
                  প্রদান করা হয়নি বা আংশিক প্রদান করা হয়েছে, তাহলে তিনি সেবা
                  প্রদানকারী কর্মকর্তা-কর্মচারীকে সেবা প্রদান প্রতিশ্রুতি
                  অনুসরণপূর্বক উক্ত সেবা প্রদান করার জন্য নির্দেশনা প্রদান
                  করবেন;
                </li>
                <li>
                  v) আইনের আওতায় নিবন্ধিত সেবা প্রদানকারী প্রতিষ্ঠানের ক্ষেত্রে
                  বিদ্যমান আইন অনুযায়ী ব্যবস্থা গ্রহণের জন্য দপ্তর প্রধানের নিকট
                  সুপারিশ করবেন।
                </li>
                <li>
                  vi) অন্যান্য ক্ষেত্রে মতামত বা সুপারিশ দপ্তর প্রধান/অভিযোগ
                  ব্যবস্থাপনা সেল/উপযুক্ত কর্তৃপক্ষের নিকট প্রেরণ করবেন।
                </li>
              </ol>
              <p>
                (চ)&nbsp; অনিক কর্তৃক সেবা প্রদানকারীকে ৭.১ (ঙ) অনুচ্ছেদে সেবা
                প্রদানের নির্দেশনা দেওয়ার পর নির্ধারিত সময়ে উক্ত নির্দেশনা
                প্রতিপালিত হলে অভিযোগটি নিষ্পন্ন করবেন। নির্দেশনা প্রতিপালিত না
                হলে ৭.১.২ অনুচ্ছেদ অনুসরণে দপ্তর প্রধানের অনুমতি গ্রহণপূর্বক
                তদন্তের উদ্যোগ গ্রহণ করবেন।
              </p>
              <p>
                (ছ)&nbsp; অনিকের নিকট সেবা প্রদানের ক্ষেত্রে কোনো প্রতিবন্ধকতা
                রয়েছে মর্মে প্রতীয়মান হলে তা সমাধানের জন্য তিনি দপ্তর প্রধানের
                নিকট সুপারিশ করবেন।
              </p>
              <p>
                (জ) তদন্ত কার্যক্রমে সেবা প্রদানের ক্ষেত্রে কোনো
                কর্মকর্তা/কর্মচারীর অসদাচরণ, বিধি-বহির্ভূত কাজ কিংবা অনিয়মের
                প্রমাণ পাওয়া গেলে দপ্তর প্রধানের অনুমতিক্রমে সরকারি কর্মচারী
                (শৃঙ্খলা ও আপিল) বিধিমালা, ২০১৮ অনুসারে ব্যবস্থা গ্রহণের জন্য
                নিয়ন্ত্রণকারী কর্তৃপক্ষের নিকট সুপারিশ করবেন।
              </p>
              <h7><a name="_Toc505267217"></a>৭.১.১. অভিযোগ যাচাই-বাছাই:</h7>
              <p>
                (ক) অভিযোগ প্রাপ্তির পর অনিক অভিযোগ যাচাই-বাছাইয়ের ক্ষেত্রে
                নিম্নোক্ত বিষয়সমূহ বিবেচনা করবেন:
              </p>
              <p>
                ১.&nbsp; অভিযোগটি সংশ্লিষ্ট-সেবাপ্রদানকারী দপ্তরের সেবা কিংবা
                পণ্যের মান অথবা পদ্ধতি-সংক্রান্ত কিনা;
              </p>
              <p>
                ২.&nbsp; সেবা প্রদানের ক্ষেত্রে সেবা প্রদান প্রতিশ্রুতি
                (Citizen’s Charter)- এ বর্ণিত সেবার মান লঙ্ঘন করা হয়েছে কিনা;
              </p>
              <p>
                ৩. অভিযোগটি কোনো নাগরিককে তাঁর প্রাপ্য সেবা থেকে বঞ্চিতকরণ কিংবা
                তাঁকে সেবা প্রদানে অযৌক্তিকভাবে বিলম্বিতকরণ-সংক্রান্ত
                কিনা;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              </p>
              <p>
                ৪.&nbsp; অভিযোগে প্রদেয়/প্রদত্ত সেবার সঙ্গে সম্পর্কিত
                বিধি-বহির্ভূত কাজ বা অনিয়মের পর্যাপ্ত উপাদান আছে কিনা;
              </p>
              <p>
                ৫. অভিযোগে সেবা প্রদানে অসদাচরণের পর্যাপ্ত উপাদান আছে কি না;
              </p>
              <p>৬. অভিযোগকারীর পূর্ণ ঠিকানা, ফোন, ই-মেইল ইত্যাদি আছে কি না;</p>
              <p>
                ৭.&nbsp; অভিযোগকারী কী বিষয়ে প্রতিকার চান সে সম্পর্কে পর্যাপ্ত
                তথ্য অভিযোগে সন্নিবেশিত আছে কি না;
              </p>
              <p>
                ৮. অনুচ্ছেদ ৬.১ (চ)-এ উল্লিখিত নির্দেশনা মোতাবেক অভিযোগ দাখিল
                করা হয়েছে কি না; এবং
              </p>
              <p>৯. অজ্ঞাতনামা হিসেবে অভিযোগ দায়ের করা হয়েছে কি না।</p>
              <p>
                (খ)&nbsp; অজ্ঞাতনামা হিসেবে অভিযোগ দায়ের করলে অভিযোগটির ওপর
                কার্যক্রম গ্রহণ করা হবে কি না, সে বিষয়ে অভিযোগের ধরন/গুরুত্ব
                অনুযায়ী অনিক যথাযথ পদক্ষেপ গ্রহণ করবেন;
              </p>
              <p>
                (গ)&nbsp; সংশ্লিষ্ট আইন বা বিধির আওতায় রিভিউ/আপিলের সুযোগ রয়েছে
                এরূপ ক্ষেত্রে রিভিউ/আপিলের সিদ্ধান্তের বিষয়ে এই নির্দেশিকার
                আওতায় কার্যক্রম গ্রহণের প্রয়োজন নেই। তবে সেবার মান লঙ্ঘনের
                ক্ষেত্রে কার্যক্রম গ্রহণ করা যাবে; এবং
              </p>
              <p>
                (ঘ)&nbsp; উক্তরূপ যাচাই-বাছাইয়ের পর অনিক যথোপযুক্ত ব্যবস্থা
                গ্রহণের মাধ্যমে অভিযোগ নিষ্পত্তির ব্যবস্থা গ্রহণ করবেন।
              </p>
              <h7><a name="_Toc505267218"></a>৭.১.২. অভিযোগ তদন্ত:</h7>
              <p>
                (ক) তদন্তের সিদ্ধান্ত গ্রহণ করার পর অনিক নিম্নরূপ উদ্যোগ গ্রহণ
                করবেন:
              </p>
              <ol>
                <li>
                  i) সংশ্লিষ্ট সেবাপ্রদানকারী কর্মকর্তা-কর্মচারী পদমর্যাদায়
                  অনিক-এর অধস্তন হলে দপ্তর প্রধানের অনুমোদনক্রমে তিনি নিজেই
                  তদন্তের কার্যক্রম গ্রহণ করতে পারবেন;
                </li>
                <li>
                  ii) সংশ্লিষ্ট সেবাপ্রদানকারী কর্মকর্তা সমপর্যায়ের বা ঊর্ধ্বতন
                  কর্মকর্তা হলে তিনি সংশ্লিষ্ট দপ্তর প্রধানের অনুমোদনক্রমে
                  উর্ধ্বতন কর্তৃপক্ষের মাধ্যমে তদন্তের কার্যক্রম গ্রহণ করবেন;
                </li>
              </ol>
              <p>
                (খ)&nbsp; অনিক নিজে অথবা সংশ্লিষ্ট সেবাপ্রদানকারী
                কর্মকর্তা/কর্মচারীর ন্যূনতম এক ধাপ ঊর্ধ্বতন কর্মকর্তাকে তদন্ত
                কর্মকর্তা হিসেবে দায়িত্ব প্রদান করে কিংবা অনধিক তিন সদস্যের
                তদন্ত কমিটি গঠন করে অভিযোগ তদন্তের ব্যবস্থা করতে পারবেন;
              </p>
              <p>
                (গ)&nbsp; তদন্ত প্রতিবেদন দাখিলের জন্য অনিক সর্বোচ্চ ২০
                কার্যদিবস সময় নির্ধারণ করে দেবেন;
              </p>
              <p>
                (ঘ)&nbsp; তদন্ত কর্মকর্তা/তদন্ত কমিটি সময় নির্ধারণ করে
                অভিযোগকারী, অভিযুক্ত কর্মকর্তা-কর্মচারী অথবা সংশ্লিষ্ট অন্য কোনো
                ব্যক্তিকে শুনানিতে হাজির হওয়া বা লিখিত বক্তব্য প্রদানের জন্য
                নোটিশ প্রদান করবেন;
              </p>
              <p>
                (ঙ) সংশ্লিষ্ট কাগজপত্র এবং বক্তব্য পর্যালোচনা করে তদন্ত
                কর্মকর্তা/তদন্ত কমিটি অনিকের নিকট সুনির্দিষ্ট মতামতসহ তদন্ত
                প্রতিবেদন দাখিল করবেন। কোনো কর্মকর্তা/কর্মচারীর অসদাচরণ,
                বিধি-বহির্ভূত কাজ কিংবা অনিয়মের প্রমাণ পাওয়া গেলে অথবা সেবা
                প্রদানে কোনো প্রতিবন্ধকতা থাকলে তা প্রতিবেদনে উল্লেখ করবেন।
              </p>
            </div>

            <div class="panel panel-default mt-5">
              <div
                class="panel-heading"
                role="button"
                data-bs-toggle="collapse"
                data-bs-target="#kt_kt_grs_guideline2"
                aria-expanded="true"
                aria-controls="kt_kt_grs_guideline2"
              >
                <h4 class="panel-title">
                  <a
                    class="accordion-toggle accordion-toggle-styled"
                    data-parent="#accordion3"
                    data-toggle="collapse"
                  >
                    <span class="processmap-span"
                      >৭.২. আপিল কর্মকর্তার কার্যপদ্ধতি:</span
                    >
                  </a>
                </h4>
              </div>
            </div>
            <div
              class="panel-body collapse show mt-5"
              id="kt_kt_grs_guideline2"
            >
              <p>
                (ক) আপিল কর্মকর্তা অনুচ্ছেদ ৭.১.১. অনুসরণ করে প্রাপ্ত আপিল
                প্রাথমিক যাচাই-বাছাইয়ের পর কার্যক্রম গ্রহণ করবেন;
              </p>
              <p>
                (খ)&nbsp; আপিল কর্মকর্তা প্রয়োজনে যুক্তিসঙ্গত সময় নির্ধারণ করে
                অনিক অথবা সংশ্লিষ্ট কর্মকর্তা-কর্মচারী বা ব্যক্তির মতামত গ্রহণ
                করবেন;
              </p>
              <p>
                (গ)&nbsp; আপিল কর্মকর্তা প্রয়োজনে অভিযোগ-সম্পর্কিত নথি,
                প্রতিবেদন, সংশ্লিষ্ট কাগজপত্রাদি, লিখিত/মৌখিক বক্তব্য ইত্যাদি
                তথ্য-প্রমাণ তলব/সংগ্রহ করতে পারবেন;
              </p>
              <p>
                (ঘ)&nbsp; আপিল কর্মকর্তা প্রয়োজনীয় ক্ষেত্রে অনুচ্ছেদ ৭.১.২ এ
                বর্ণিত অনিকের অনুসৃত পদ্ধতির ন্যায় তদন্তের উদ্যোগ গ্রহণ করতে
                পারবেন;
              </p>
              <p>
                (ঙ) সকল কাগজপত্র, মতামত এবং প্রযোজ্য ক্ষেত্রে তদন্ত প্রতিবেদন
                পর্যালোচনা করে আপিল কর্মকর্তার নিকট যদি প্রতীয়মান হয়:
              </p>
              <ol>
                <li>
                  i) অনিক-এর সিদ্ধান্ত যথাযথ ছিল, তবে তিনি অনিকের সিদ্ধান্ত
                  সমর্থন করে সংশ্লিষ্ট সকলকে তাঁর সিদ্ধান্ত অবহিত করবেন;
                </li>
                <li>
                  ii) সেবাপ্রদানকারী কর্মকর্তা/কর্মচারী অনিকের সিদ্ধান্ত
                  যথাযথভাবে প্রতিপালন করেননি, সেক্ষেত্রে সিদ্ধান্ত প্রতিপালনের
                  জন্য তিনি সেবা প্রদানকারীকে নির্দেশনা প্রদান করবেন;
                </li>
              </ol>
              <ul>
                <li>
                  iii) অনিকের সিদ্ধান্ত যথাযথ না হলে, সেক্ষেত্রে তিনি উপযুক্ত
                  নির্দেশনা প্রদান করবেন;
                </li>
              </ul>
              <ol>
                <li>
                  iv) অভিযুক্ত কর্মকর্তা/কর্মচারীর অসদাচরণ, বিধি-বহির্ভূত কাজ
                  কিংবা অনিয়মের প্রমাণ পাওয়া গেলে দপ্তর প্রধানের অনুমতিক্রমে
                  সরকারি কর্মচারী (শৃঙ্খলা ও আপিল) বিধিমালা, ২০১৮ অনুসারে
                  ব্যবস্থা গ্রহণের জন্য নিয়ন্ত্রণকারী কর্তৃপক্ষের নিকট সুপারিশ
                  করবেন;
                </li>
                <li>
                  v) অন্যান্য ক্ষেত্রে মতামত বা সুপারিশ দপ্তর প্রধান/অভিযোগ
                  ব্যবস্থাপনা সেল/উপযুক্ত কর্তৃপক্ষের নিকট প্রেরণ করবেন।
                </li>
              </ol>
            </div>
            <div class="panel panel-default mt-5">
              <div
                class="panel-heading"
                role="button"
                data-bs-toggle="collapse"
                data-bs-target="#kt_kt_grs_guideline3"
                aria-expanded="true"
                aria-controls="kt_kt_grs_guideline3"
              >
                <h4 class="panel-title">
                  <a
                    class="accordion-toggle accordion-toggle-styled"
                    data-parent="#accordion3"
                    data-toggle="collapse"
                  >
                    <span class="processmap-span"
                      >৭.৩. অভিযোগ ব্যবস্থাপনা সেলের কার্যপদ্ধতি:</span
                    >
                  </a>
                </h4>
              </div>
            </div>
            <div
              class="panel-body collapse show mt-5"
              id="kt_kt_grs_guideline3"
            >
              <p>
                (ক) অভিযোগ ব্যবস্থাপনা সেলের নিকট অভিযোগ/আপিল দাখিল করা হয়ে
                থাকলে সেলের সদস্য সচিব অনুচ্ছেদ ৭.১.১ অনুসরণ করে প্রাথমিক
                যাচাই-বাছাইয়ের পর সেলের নিকট সিদ্ধান্তের জন্য উপস্থাপন করবেন।
              </p>
              <p>
                (খ)&nbsp; অভিযোগ ব্যবস্থাপনা সেল প্রয়োজন মনে করলে মতামত প্রদানের
                জন্য অনিক বা আপিল কর্মকর্তা অথবা সংশ্লিষ্ট ব্যক্তির মতামত গ্রহণ
                করবেন। এক্ষেত্রে তিনি মতামত প্রদানের জন্য সময় নির্ধারণ করে
                দেবেন;
              </p>
              <p>
                (গ)&nbsp; অভিযোগ ব্যবস্থাপনা সেল প্রয়োজনে অভিযোগ সম্পর্কিত নথি,
                দলিল, প্রতিবেদন, লিখিত/মৌখিক বক্তব্য ইত্যাদি তথ্য-প্রমাণ সংগ্রহ
                করতে পারবেন;
              </p>
              <p>
                (ঘ)&nbsp; তদন্তের উদ্যোগ গ্রহণের প্রয়োজন হলে সেল অনুচ্ছেদ ৭.১.২
                অনুসরণ করে কার্যক্রম গ্রহণ করবে।
              </p>
              <p>
                (ঙ) সকল কাগজপত্র, মতামত এবং প্রযোজ্য ক্ষেত্রে তদন্ত প্রতিবেদন
                প্রাপ্তির পর অভিযোগ ব্যবস্থাপনা সেল নিম্নোরূপ পদক্ষেপ গ্রহণ
                করবে:
              </p>
              <ol>
                <li>
                  i) অভিযোগ সঠিক সময়ে নিষ্পত্তি না হলে দপ্তর প্রধানের নিকট অবহিত
                  করতে পারবেন;
                </li>
                <li>
                  ii) যদি প্রতীয়মান হয় যে, অভিযোগ যথাযথভাবে নিষ্পত্তি করা হয়নি,
                  তাহলে সেল সংশ্লিষ্ট কর্তৃপক্ষকে যথাযথ সিদ্ধান্ত প্রদান করবে;
                </li>
              </ol>
              <ul>
                <li>
                  iii) সেবা প্রদানের বিষয়ে কোনো প্রতিবন্ধকতা রয়েছে মর্মে
                  প্রতীয়মান হলে তা সমাধানের জন্য সংশ্লিষ্ট মন্ত্রণালয়/বিভাগকে
                  সুপারিশ প্রদান করবে;
                </li>
              </ul>
              <ol>
                <li>
                  iv) অভিযুক্ত কর্মকর্তা/কর্মচারীর বিরুদ্ধে অসদাচরণ,
                  বিধি-বহির্ভূত কাজ কিংবা অনিয়মের প্রমাণ পাওয়া গেলে অথবা সেলের
                  নির্দেশনা প্রতিপালন না করলে মন্ত্রিপরিষদ সচিবকে অবহিত রেখে
                  সরকারি কর্মচারী (শৃঙ্খলা ও আপিল) বিধিমালা, ২০১৮ অনুসারে
                  ব্যবস্থা গ্রহণের জন্য নিয়ন্ত্রণকারী কর্তৃপক্ষের নিকট প্রেরণ
                  করবে;
                </li>
                <li>
                  v) অন্যান্য ক্ষেত্রে মতামত বা সুপারিশ দপ্তর প্রধান/উপযুক্ত
                  কর্তৃপক্ষের নিকট প্রেরণ করবে;
                </li>
              </ol>
              <p>
                (চ)&nbsp; প্রযোজ্য ক্ষেত্রে অভিযোগ ব্যবস্থাপনা সেল মতামত বা
                সুপারিশ কেন্দ্রীয় অভিযোগ ব্যবস্থাপনা স্টিয়ারিং কমিটির নিকট
                অনুমোদনের জন্য উপস্থাপন করবে এবং তা সংশ্লিষ্ট দপ্তরে প্রেরণ
                করবে।
              </p>
            </div>
            <div class="panel panel-default mt-5">
              <div
                class="panel-heading"
                role="button"
                data-bs-toggle="collapse"
                data-bs-target="#kt_kt_grs_guideline4"
                aria-expanded="true"
                aria-controls="kt_kt_grs_guideline4"
              >
                <h4 class="panel-title">
                  <a
                    class="accordion-toggle accordion-toggle-styled"
                    data-parent="#accordion3"
                    data-toggle="collapse"
                  >
                    <span class="processmap-span"
                      >৭.৪. অভিযোগ ও আপিল নিষ্পত্তি:</span
                    >
                  </a>
                </h4>
              </div>
            </div>
            <div
              class="panel-body collapse show mt-5"
              id="kt_kt_grs_guideline4"
            >
              <p>
                (ক) অনিক, আপিল কর্মকর্তা অথবা অভিযোগ ব্যবস্থাপনা সেল কর্তৃক
                প্রদত্ত সেবা প্রদানের নির্দেশনা প্রতিপালিত হলে অভিযোগ নিষ্পত্তি
                হয়েছে মর্মে গণ্য হবে;
              </p>
              <p>
                (খ)&nbsp; তদন্ত প্রতিবেদন পর্যালোচনা করে তা সন্তোষজনক হলে অভিযোগ
                নিষ্পত্তি করতে পারবে;
              </p>
              <p>
                (গ)&nbsp; দায়িত্বপ্রাপ্ত কর্মকর্তা অথবা অভিযুক্ত
                কর্মকর্তা/কর্মচারী সেবা প্রদান করা সম্ভব নয় মর্মে মতামত প্রদান
                করলে এবং তা সন্তোষজনক বলে বিবেচিত হলে অনিক, আপিল কর্মকর্তা অথবা
                অভিযোগ ব্যবস্থাপনা সেল প্রযোজ্য ক্ষেত্রে অভিযোগ নিষ্পত্তি করতে
                পারবেন;
              </p>
              <p>
                (ঘ)&nbsp; অনিক, আপিল কর্মকর্তা অথবা অভিযোগ ব্যবস্থাপনা সেল
                কর্তৃক সরকারি কর্মচারী (শৃঙ্খলা ও আপিল) বিধিমালা, ২০১৮ অনুসারে
                ব্যবস্থা গ্রহণের জন্য সুপারিশ করা হলে অভিযোগ নিষ্পত্তি হয়েছে
                মর্মে গণ্য হবে;
              </p>
              <p>
                (ঙ) অভিযোগ ব্যবস্থাপনা সেল কর্তৃক মন্ত্রণালয়/বিভাগে সুপারিশ অথবা
                নির্দেশনা প্রদান করা হলে অভিযোগ নিষ্পত্তি হয়েছে মর্মে গণ্য হবে;
              </p>
              <p>
                (চ)&nbsp; অভিযোগ ব্যবস্থাপনা সেল কর্তৃক কেন্দ্রীয় অভিযোগ
                ব্যবস্থাপনা স্টিয়ারিং কমিটির অনুমোদিত মতামত বা সুপারিশ সংশ্লিষ্ট
                দপ্তরে প্রেরণ এবং তা বাস্তবায়ন করা হলে অভিযোগ নিষ্পত্তি হয়েছে
                মর্মে গণ্য হবে;
              </p>
              <p>
                (ছ)&nbsp; প্রতিটি অভিযোগ নিষ্পত্তির সঙ্গে সঙ্গে ইলেক্ট্রনিক
                মাধ্যমে অথবা ডাকযোগে বা বাহকের মাধ্যমে ৭(সাত) কার্যদিবসের মধ্যে
                অভিযোগকারীকে অভিযোগের ফলাফল সম্পর্কে অবহিত করতে হবে ।
              </p>
              <h3>
                <a name="_Toc505267222"></a>৭.৪.১. অভিযোগ ও আপিল নিষ্পত্তির
                সময়সীমা:
              </h3>
              <p>
                (ক) অনিক কর্তৃক অভিযোগ নিষ্পত্তির সর্বোচ্চ সময়সীমা নিম্নরূপ-
              </p>
              <ol>
                <li>
                  i) সাধারণভাবে অভিযোগ নিষ্পত্তির সর্বোচ্চ সময়সীমা হবে ৩০
                  কার্যদিবস;
                </li>
                <li>
                  ii) তদন্তের উদ্যোগ গৃহীত হলে অতিরিক্ত ১০ কার্যদিবস সময়ের মধ্যে
                  অভিযোগ নিষ্পত্তি করতে হবে।
                </li>
              </ol>
              <p>
                (খ)&nbsp; আপিল নিষ্পত্তির সর্বোচ্চ সময়সীমা আপিল দাখিলের তারিখ
                থেকে অনধিক ২০ কার্যদিবস;
              </p>
              <p>
                (গ)&nbsp; অভিযোগ ব্যবস্থাপনা সেল কর্তৃক অভিযোগ/আপিল নিষ্পত্তির
                সর্বোচ্চ সময়সীমা হবে অনধিক ৬০ কার্যদিবস।
              </p>
              <p>
                (ঘ)&nbsp; অনুচ্ছেদ ৭.৩ (চ) অনুসারে সেল কর্তৃক সুপারিশ বা পরামর্শ
                প্রদানের ২০ কার্যদিবসের মধ্যে মন্ত্রণালয়/বিভাগ তা নিষ্পত্তির
                ব্যবস্থা নেবে।
              </p>
            </div>
            <div class="panel panel-default mt-5">
              <div
                class="panel-heading"
                role="button"
                data-bs-toggle="collapse"
                data-bs-target="#kt_kt_grs_guideline5"
                aria-expanded="true"
                aria-controls="kt_kt_grs_guideline5"
              >
                <h4 class="panel-title">
                  <a
                    class="accordion-toggle accordion-toggle-styled"
                    data-parent="#accordion3"
                    data-toggle="collapse"
                  >
                    <span class="processmap-span"
                      >৮. অসত্য/হয়রানিমূলক অভিযোগের বিষয়ে করণীয়:</span
                    >
                  </a>
                </h4>
              </div>
            </div>
            <div
              class="panel-body collapse show mt-5"
              id="kt_kt_grs_guideline5"
            >
              <p>
                কোনো অভিযোগকারী অভ্যাসগতভাবে অসত্য এবং কাউকে হয়রানি করার জন্য
                কিংবা অন্য কোনো অসৎ উদ্দেশ্যে অভিযোগ দাখিল করেন মর্মে প্রমাণিত
                হলে অনিক-এর সুপারিশের ভিত্তিতে সংশ্লিষ্ট আপিল কর্মকর্তা উক্ত
                অভিযোগকারীকে কালো তালিকাভুক্ত করতে পারবেন। এরূপ কালো তালিকাভুক্ত
                ব্যক্তির নিকট থেকে পরবর্তী সময়ে প্রাপ্ত কোনো অভিযোগ কর্তৃপক্ষ
                বিনা পদক্ষেপে খারিজ করতে পারবেন। তাছাড়া তালিকাভূক্ত কোন
                অভিযোগকারী অনলাইনে কোন অভিযোগ দাখিলের অনুমতি পাবেন না।
              </p>
            </div>
          </div>
        </div>
      </div>
      <!--end::Timeline items-->
    </div>
    <!--end::Content-->
  </div>
  <!--end::Body-->

  <!--end::kt_anik_or_appeal_offcier_activity drawer-->
</template>

<script lang="ts">
import { computed, defineComponent, onMounted, ref } from "vue";
import { getAssetPath } from "@/core/helpers/assets";
import { useI18n } from "vue-i18n";

export default defineComponent({
  name: "anik_or_appeal_offcier_activity-drawer",
  components: {},
  setup() {
    const index = 0;
    const shown: boolean = false;
    const { t, te } = useI18n();
    const i18n = useI18n();
    i18n.locale.value = localStorage.getItem("lang")
      ? (localStorage.getItem("lang") as string)
      : "bn";
    const translate = (text: string) => {
      if (te(text)) {
        return t(text);
      } else {
        return text;
      }
    };
    const currentLanguage = computed(() => {
      return i18n.locale.value;
    });

    return {
      index,
      getAssetPath,
      translate,
      currentLanguage,
    };
  },
});
</script>
